kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
#define DMA0_BASE           0x40020000UL
#define DMA0_Channel0_BASE  (DMA0_BASE + 0x00000008UL)
#define DMA0_Channel1_BASE  (DMA0_BASE + 0x0000001CUL)
#define DMA0_Channel2_BASE  (DMA0_BASE + 0x00000030UL)
#define DMA0_Channel3_BASE  (DMA0_BASE + 0x00000044UL)
#define DMA0_Channel4_BASE  (DMA0_BASE + 0x00000058UL)
#define DMA0_Channel5_BASE  (DMA0_BASE + 0x0000006CUL)
#define DMA0_Channel6_BASE  (DMA0_BASE + 0x00000080UL)
#define DMA1_BASE           0x40020400UL
#define DMA1_Channel0_BASE  (DMA1_BASE + 0x00000008UL)
#define DMA1_Channel1_BASE  (DMA1_BASE + 0x0000001CUL)
#define DMA1_Channel2_BASE  (DMA1_BASE + 0x00000030UL)
#define DMA1_Channel3_BASE  (DMA1_BASE + 0x00000044UL)
#define DMA1_Channel4_BASE  (DMA1_BASE + 0x00000058UL)

// APB1 memory map
#define CTC_BASE            0x4000C800UL
#define DAC_BASE            0x40007400UL
#define PMU_BASE            0x40007000UL
#define BKP_BASE            0x40006C00UL
#define I2C1_BASE           0x40005800UL
#define I2C0_BASE           0x40005400UL
#define UART4_BASE          0x40005000UL
#define UART3_BASE          0x40004C00UL
#define USART2_BASE         0x40004800UL
#define USART1_BASE         0x40004400UL
#define SPI2_BASE           0x40003C00UL
#define SPI1_BASE           0x40003800UL
#define FWDGT_BASE          0x40003000UL
#define WWDGT_BASE          0x40002C00UL
#define RTC_BASE            0x40002800UL
#define TIMER13_BASE        0x40002000UL
#define TIMER12_BASE        0x40001C00UL
#define TIMER11_BASE        0x40001800UL
#define TIMER6_BASE         0x40001400UL
#define TIMER5_BASE         0x40001000UL
#define TIMER4_BASE         0x40000C00UL
#define TIMER3_BASE         0x40000800UL
#define TIMER2_BASE         0x40000400UL
#define TIMER1_BASE         0x40000000UL

// APB2 memory map
#define TIMER10_BASE        0x40015400UL
#define TIMER9_BASE         0x40015000UL
#define TIMER8_BASE         0x40014C00UL
#define USART0_BASE         0x40013800UL
#define TIMER7_BASE         0x40013400UL
#define SPI0_BASE           0x40013000UL
#define TIMER0_BASE         0x40012C00UL
#define ADC1_BASE           0x40012800UL
#define ADC0_BASE           0x40012400UL
#define GPIOE_BASE          0x40011800UL
#define GPIOD_BASE          0x40011400UL
#define GPIOC_BASE          0x40011000UL
#define GPIOB_BASE          0x40010C00UL
#define GPIOA_BASE          0x40010800UL
#define EXTI_BASE           0x40010400UL
#define AFIO_BASE           0x40010000UL

#if 1 // =========================== GPIO ======================================
struct GPIO_TypeDef {
    volatile uint32_t CTL0;     /*!< 0x00 GPIO port control register 0 */
    volatile uint32_t CTL1;     /*!< 0x04 GPIO port control register 1 */
    volatile uint32_t ISTAT;    /*!< 0x08 GPIO port input status register */
    volatile uint32_t OCTL;     /*!< 0x0C GPIO port output control register */
    volatile uint32_t BOP;      /*!< 0x10 GPIO port bit operation register */
    volatile uint32_t BC;       /*!< 0x14 GPIO bit clear register */
    volatile uint32_t LOCK;     /*!< 0x18 GPIO port configuration lock register */
    volatile uint32_t _Reserved[8];
    volatile uint32_t SPD;      /*!< 0x3C GPIO port bit speed register */

    void SetCtlMode(uint32_t PinN, uint32_t CtlMode) {
        if(PinN < 8) {
            uint32_t Offset = PinN * 4;
            CTL0 = (CTL0 & ~(0b1111UL << Offset)) | (CtlMode << Offset);
        }
        else {
            uint32_t Offset = (PinN - 8) * 4;
            CTL1 = (CTL1 & ~(0b1111UL << Offset)) | (CtlMode << Offset);
        }
    }
};

/* GPIOx(x=A,B,C,D,E) definitions */
#define GPIOA   ((GPIO_TypeDef*)GPIOA_BASE)
#define GPIOB   ((GPIO_TypeDef*)GPIOB_BASE)
#define GPIOC   ((GPIO_TypeDef*)GPIOC_BASE)
#define GPIOD   ((GPIO_TypeDef*)GPIOD_BASE)
#define GPIOE   ((GPIO_TypeDef*)GPIOE_BASE)

#if 1 // ==== Pins ====
#define PA0    GPIOA, 0
#define PA1    GPIOA, 1
#define PA2    GPIOA, 2
#define PA3    GPIOA, 3
#define PA4    GPIOA, 4
#define PA5    GPIOA, 5
#define PA6    GPIOA, 6
#define PA7    GPIOA, 7
#define PA8    GPIOA, 8
#define PA9    GPIOA, 9
#define PA10    GPIOA, 10
#define PA11    GPIOA, 11
#define PA12    GPIOA, 12
#define PA13    GPIOA, 13
#define PA14    GPIOA, 14
#define PA15    GPIOA, 15

#define PB0    GPIOB, 0
#define PB1    GPIOB, 1
#define PB2    GPIOB, 2
#define PB3    GPIOB, 3
#define PB4    GPIOB, 4
#define PB5    GPIOB, 5
#define PB6    GPIOB, 6
#define PB7    GPIOB, 7
#define PB8    GPIOB, 8
#define PB9    GPIOB, 9
#define PB10    GPIOB, 10
#define PB11    GPIOB, 11
#define PB12    GPIOB, 12
#define PB13    GPIOB, 13
#define PB14    GPIOB, 14
#define PB15    GPIOB, 15

#define PC0    GPIOC, 0
#define PC1    GPIOC, 1
#define PC2    GPIOC, 2
#define PC3    GPIOC, 3
#define PC4    GPIOC, 4
#define PC5    GPIOC, 5
#define PC6    GPIOC, 6
#define PC7    GPIOC, 7
#define PC8    GPIOC, 8
#define PC9    GPIOC, 9
#define PC10    GPIOC, 10
#define PC11    GPIOC, 11
#define PC12    GPIOC, 12
#define PC13    GPIOC, 13
#define PC14    GPIOC, 14
#define PC15    GPIOC, 15

#define PD0    GPIOD, 0
#define PD1    GPIOD, 1
#define PD2    GPIOD, 2
#define PD3    GPIOD, 3
#define PD4    GPIOD, 4
#define PD5    GPIOD, 5
#define PD6    GPIOD, 6
#define PD7    GPIOD, 7
#define PD8    GPIOD, 8
#define PD9    GPIOD, 9
#define PD10    GPIOD, 10
#define PD11    GPIOD, 11
#define PD12    GPIOD, 12
#define PD13    GPIOD, 13
#define PD14    GPIOD, 14
#define PD15    GPIOD, 15

#define PE0    GPIOE, 0
#define PE1    GPIOE, 1
#define PE2    GPIOE, 2
#define PE3    GPIOE, 3
#define PE4    GPIOE, 4
#define PE5    GPIOE, 5
#define PE6    GPIOE, 6
#define PE7    GPIOE, 7
#define PE8    GPIOE, 8
#define PE9    GPIOE, 9
#define PE10    GPIOE, 10
#define PE11    GPIOE, 11
#define PE12    GPIOE, 12
#define PE13    GPIOE, 13
#define PE14    GPIOE, 14
#define PE15    GPIOE, 15
#endif

// AFIO registers definitions
struct AFIO_TypeDef {
    volatile uint32_t EC;      /*!< 0x00 AFIO event control register */
    volatile uint32_t PCF0;    /*!< 0x04 AFIO port configuration register 0 */
    volatile uint32_t EXTISS[4]; /*!< 0x08..0x14 AFIO port EXTI sources selection register 0..3 */
    volatile uint32_t _Reserved; // 0x18
    volatile uint32_t PCF1;    /*!< 0x1C AFIO port configuration register 1 */
    volatile uint32_t CPSCTL;  /*!< 0x20 AFIO IO compensation control register */

