kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
    void DisableJtagDP() { SET_BITS(PCF0, 0b111UL, 0b010UL, 24); }

    void RemapSPI0_PB345()  { PCF0 |= 1 << 0; } // Remap SPI0 from PA 5,6,7 to PB 3,4,5
    void RemapI2C0_PB89()   { PCF0 |= 1 << 1; } // Remap I2C0 from PB 6,7 to PB 8,9
    void RemapUSART0_PB67() { PCF0 |= 1 << 2; } // Remap USART0 from PA 9,10 to PB 6,7
    void RemapUSART1_PD56() { PCF0 |= 1 << 3; } // Remap USART1 from PA 2,3 to PD 5,6
    void RemapTim2_PB4501() { SET_BITS(PCF0, 0b11UL, 0b10UL, 10); } // PB 4,5,0,1
    void RemapTim2_PC6789() { PCF0 |= 0b11UL << 10; } // PC 6,7,8,9
};

#define AFIO   ((AFIO_TypeDef*)AFIO_BASE)
#endif // GPIO

#if 1 // =========================== EXTI ======================================
struct EXTI_TypeDef {
    volatile uint32_t INTEN; /*!< 0x00 Interrupt enable register */
    volatile uint32_t EVEN;  /*!< 0x04 Event enable register */
    volatile uint32_t RTEN;  /*!< 0x08 Rising edge trigger enable register */
    volatile uint32_t FTEN;  /*!< 0x0C Falling edge trigger enable register */
    volatile uint32_t SWIEV; /*!< 0x10 Software interrupt event register */
    volatile uint32_t PD;    /*!< 0x14 Pending register */
};

#define EXTI    ((EXTI_TypeDef*) EXTI_BASE)
#endif // EXTI

#if 1 // =========================== UART ======================================
/* USARTx_STAT0 */
#define USART_STAT0_PERR    (1UL << 0)
#define USART_STAT0_FERR    (1UL << 1)
#define USART_STAT0_NERR    (1UL << 2)
#define USART_STAT0_ORERR   (1UL << 3)
#define USART_STAT0_IDLEF   (1UL << 4)
#define USART_STAT0_RBNE    (1UL << 5)
#define USART_STAT0_TC      (1UL << 6)
#define USART_STAT0_TBE     (1UL << 7)
#define USART_STAT0_LBDF    (1UL << 8)
#define USART_STAT0_CTSF    (1UL << 9)

/* USARTx_CTL0 */
#define USART_CTL0_SBKCMD   (1UL << 0) // send break command
#define USART_CTL0_RWU      (1UL << 1) // receiver wakeup from mute mode
#define USART_CTL0_REN      (1UL << 2) // enable receiver
#define USART_CTL0_TEN      (1UL << 3) // enable transmitter
#define USART_CTL0_IDLEIE   (1UL << 4) // enable idle line detected interrupt
#define USART_CTL0_RBNEIE   (1UL << 5) // enable read data buffer not empty interrupt and overrun error interrupt
#define USART_CTL0_TCIE     (1UL << 6) // enable transmission complete interrupt
#define USART_CTL0_TBEIE    (1UL << 7) // enable transmitter buffer empty interrupt
#define USART_CTL0_PERRIE   (1UL << 8) // enable parity error interrupt
#define USART_CTL0_PM       (1UL << 9) // parity mode
#define USART_CTL0_PCEN     (1UL << 10) // enable parity check function
#define USART_CTL0_WM       (1UL << 11) // wakeup method in mute mode
#define USART_CTL0_WL       (1UL << 12) // word length
#define USART_CTL0_UEN      (1UL << 13) // enable USART

/* USARTx_CTL2 */
#define USART_CTL2_ERRIE    (1UL << 0) // enable error interrupt
#define USART_CTL2_IREN     (1UL << 1) // enable IrDA mode
#define USART_CTL2_IRLP     (1UL << 2) // IrDA low-power
#define USART_CTL2_HDEN     (1UL << 3) // enable half-duplex
#define USART_CTL2_NKEN     (1UL << 4) // mode NACK enable in smartcard
#define USART_CTL2_SCEN     (1UL << 5) // senable martcard mode
#define USART_CTL2_DENR     (1UL << 6) // enable DMA request for reception
#define USART_CTL2_DENT     (1UL << 7) // enable DMA request for transmission
#define USART_CTL2_RTSEN    (1UL << 8) // enable RTS
#define USART_CTL2_CTSEN    (1UL << 9) // enable CTS
#define USART_CTL2_CTSIE    (1UL << 10) // enable CTS interrupt

struct USART_TypeDef {
    volatile uint32_t STAT0; // 0
    volatile uint32_t DATA;  // 4
    volatile uint32_t BAUD;  // 8
    volatile uint32_t CTL0;  // C
    volatile uint32_t CTL1;  // 10
    volatile uint32_t CTL2;  // 14
    volatile uint32_t GP;    // 18
    volatile uint32_t _Reserved1[25];
    volatile uint32_t CTL3;  // 80
    volatile uint32_t RT;    // 84
    volatile uint32_t STAT1; // 88
    volatile uint32_t _Reserved2[13];
    volatile uint32_t CHC; // C0

    void EnableTx()  { CTL0 |=  USART_CTL0_TEN; }
    void DisableTx() { CTL0 &= ~USART_CTL0_TEN; }
    void EnableRx()  { CTL0 |=  USART_CTL0_REN; }
    void DisableRx() { CTL0 &= ~USART_CTL0_REN; }
};

#define USART0      ((USART_TypeDef*)USART0_BASE)
#define USART1      ((USART_TypeDef*)USART1_BASE)
#define USART2      ((USART_TypeDef*)USART2_BASE)
#define UART3       ((USART_TypeDef*)UART3_BASE)
#define UART4       ((USART_TypeDef*)UART4_BASE)

#endif // UART

#if 1 // ============================== DMA ====================================
struct DMABlock_t {
    volatile uint32_t INTF;
    volatile uint32_t INTC;
};

struct DMAChannel_t {
    volatile uint32_t CTL;
    volatile uint32_t CNT;
    volatile uint32_t CPADDR;
    volatile uint32_t CMADDR;
};

#define DMA0                ((DMABlock_t *)DMA0_BASE)
#define DMA1                ((DMABlock_t *)DMA1_BASE)

#define DMA0_Channel0       ((DMAChannel_t *)DMA0_Channel0_BASE)
#define DMA0_Channel1       ((DMAChannel_t *)DMA0_Channel1_BASE)
#define DMA0_Channel2       ((DMAChannel_t *)DMA0_Channel2_BASE)
#define DMA0_Channel3       ((DMAChannel_t *)DMA0_Channel3_BASE)
#define DMA0_Channel4       ((DMAChannel_t *)DMA0_Channel4_BASE)
#define DMA0_Channel5       ((DMAChannel_t *)DMA0_Channel5_BASE)
#define DMA0_Channel6       ((DMAChannel_t *)DMA0_Channel6_BASE)

#define DMA1_Channel0       ((DMAChannel_t *)DMA1_Channel0_BASE)
#define DMA1_Channel1       ((DMAChannel_t *)DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMAChannel_t *)DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMAChannel_t *)DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMAChannel_t *)DMA1_Channel4_BASE)

#define DMA_MEM2MEM_MODE        (1UL << 14)

#define DMA_PRIO_LOW            (0b00UL << 12)
#define DMA_PRIO_MEDIUM         (0b01UL << 12)
#define DMA_PRIO_HIGH           (0b10UL << 12)
#define DMA_PRIO_VERYHIGH       (0b11UL << 12)

#define DMA_MEMSZ_8_BIT         (0b00UL << 10)
#define DMA_MEMSZ_16_BIT        (0b01UL << 10)
#define DMA_MEMESZ_32_BIT       (0b10UL << 10)

#define DMA_PERSZ_8_BIT         (0b00UL << 8)
#define DMA_PERSZ_16_BIT        (0b01UL << 8)
#define DMA_PERSZ_32_BIT        (0b10UL << 8)

#define DMA_MEM_INC             (1UL << 7)
#define DMA_PER_INC             (1UL << 6)
#define DMA_CIRC                (1UL << 5)

#define DMA_DIR_MEM2PER         (1UL << 4)
#define DMA_DIR_PER2MEM         (0UL << 4)

