kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
#define DMA_ERRIE               (1UL << 3)
#define DMA_HTFIE               (1UL << 2)
#define DMA_TCIE                (1UL << 1)

#define DMA0_CHNL_CNT           (7UL)
#define DMA1_CHNL_CNT           (5UL)
#define DMA_CHNL_CNT            (DMA0_CHNL_CNT + DMA1_CHNL_CNT)
// Translate dma0 chnls[0;6] and dma1 chnls [0;4] to chnls[0; 12]
#define DMA_CHNL(dma, chnl)     ((dma) * 7 + (chnl))

#define DMA_CHNL_EN             (1UL << 0)
#endif // DMA

#if 1 // ============================= Timer ===================================
// Bits
#define TIM_CTL0_CEN        (1UL << 0)
#define TIM_CTL0_UPDIS      (1UL << 1)
#define TIM_CTL0_UPS        (1UL << 2)
#define TIM_CTL0_SPM        (1UL << 3)
#define TIM_CTL0_DIR        (1UL << 4)
#define TIM_CTL0_ARSE       (1UL << 7)
#define TIM_SMCFG_ETP       (1UL << 15)

#define TIM_DMAINTEN_UPIE   (1UL << 0)
#define TIM_DMAINTEN_CH0IE  (1UL << 1)
#define TIM_DMAINTEN_CH1IE  (1UL << 2)
#define TIM_DMAINTEN_CH2IE  (1UL << 3)
#define TIM_DMAINTEN_CH3IE  (1UL << 4)
#define TIM_DMAINTEN_TRGIE  (1UL << 6)
#define TIM_DMAINTEN_UPDEN  (1UL << 8)
#define TIM_DMAINTEN_CH0DEN (1UL << 9)
#define TIM_DMAINTEN_CH1DEN (1UL << 10)
#define TIM_DMAINTEN_CH2DEN (1UL << 11)
#define TIM_DMAINTEN_CH3DEN (1UL << 12)
#define TIM_DMAINTEN_DMAEN(chnl)    (1UL << (9UL + chnl))
#define TIM_DMAINTEN_TRGDEN (1UL << 14)

#define TIM_INTF_UPIF       (1UL << 0)
#define TIM_INTF_CH0IF      (1UL << 1)
#define TIM_INTF_CH1IF      (1UL << 2)
#define TIM_INTF_CH2IF      (1UL << 3)
#define TIM_INTF_CH3IF      (1UL << 4)
#define TIM_SWEVG_UPG       (1UL << 0)

struct TIM_TypeDef {
    volatile uint32_t CTL0;     /*!< 0x00 control register 1 */
    volatile uint32_t CTL1;     /*!< 0x04 control register 2 */
    volatile uint32_t SMCFG;    /*!< 0x08 slave mode control register */
    volatile uint32_t DMAINTEN; /*!< 0x0C DMA/interrupt enable register */
    volatile uint32_t INTF;     /*!< 0x10 status register */
    volatile uint32_t SWEVG;    /*!< 0x14 event generation register */
    volatile uint32_t CHCTL0;   /*!< 0x18 Channel control register 0 */
    volatile uint32_t CHCTL1;   /*!< 0x1C Channel control register 1 */
    volatile uint32_t CHCTL2;   /*!< 0x20 Channel control register 2 */
    volatile uint32_t CNT;      /*!< 0x24 counter register */
    volatile uint32_t PSC;      /*!< 0x28 prescaler */
    volatile uint32_t CAR;      /*!< 0x2C auto-reload register */
    volatile uint32_t CREP;     /*!< 0x30 repetition counter register */
    volatile uint32_t CH0CV;    /*!< 0x34 capture/compare value register 0 */
    volatile uint32_t CH1CV;    /*!< 0x38 capture/compare value register 1 */
    volatile uint32_t CH2CV;    /*!< 0x3C capture/compare value register 3 */
    volatile uint32_t CH3CV;    /*!< 0x40 capture/compare value register 4 */
    volatile uint32_t CCHP;     /*!< 0x44 Complementary channel protection register */
    volatile uint32_t DMACFG;   /*!< 0x48 DMA configuration register */
    volatile uint32_t DMATB;    /*!< 0x4C DMA transfer buffer register */
    volatile uint32_t _Reserved[43];
    volatile uint32_t CFG;      /*!< 0xFC Configuration register */

    void Enable()  { CTL0 |=  TIM_CTL0_CEN; }
    void Disable() { CTL0 &= ~TIM_CTL0_CEN; }
    void SetTopValue(uint32_t value) { CAR = value; }
    uint32_t GetTopValue() { return CAR; }
    void SetPrescaler(uint32_t psc) { PSC = psc; }
    uint32_t GetPrescaler() { return PSC; }
    void SetChnlValue(const uint32_t Chnl, uint32_t value) { *(uint32_t*)(&CH0CV + Chnl) = value; }
    void GenerateUpdateEvt() { SWEVG = (1UL << 0); }
};

// Timers
#define TIM0    ((TIM_TypeDef*)TIMER0_BASE)
#define TIM1    ((TIM_TypeDef*)TIMER1_BASE)
#define TIM2    ((TIM_TypeDef*)TIMER2_BASE)
#define TIM3    ((TIM_TypeDef*)TIMER3_BASE)
#define TIM4    ((TIM_TypeDef*)TIMER4_BASE)
#define TIM5    ((TIM_TypeDef*)TIMER5_BASE)
#define TIM6    ((TIM_TypeDef*)TIMER6_BASE)
#define TIM7    ((TIM_TypeDef*)TIMER7_BASE)
#define TIM8    ((TIM_TypeDef*)TIMER8_BASE)
#define TIM9    ((TIM_TypeDef*)TIMER9_BASE)
#define TIM10   ((TIM_TypeDef*)TIMER10_BASE)
#define TIM11   ((TIM_TypeDef*)TIMER11_BASE)
#define TIM12   ((TIM_TypeDef*)TIMER12_BASE)
#define TIM13   ((TIM_TypeDef*)TIMER13_BASE)

#define TIM_CNT    14 // [TIM0; TIM13]
#endif // timer

#if 1 // ======================= Free Watchdog =================================
struct FWDGT_TypeDef {
    volatile uint32_t CTL;  // 0x00 Control register
    volatile uint32_t PSC;  // 0x04 Prescaler register
    volatile uint32_t RLD;  // 0x08 Reload register
    volatile uint32_t STAT; // 0x0C Status register
};

#define FWDGT       ((FWDGT_TypeDef*)FWDGT_BASE)
#endif

#if 1 // ============================= SPI =====================================
#define SPI_CTL0_CKPH       (1UL << 0)
#define SPI_CTL0_CKPL       (1UL << 1)
#define SPI_CTL0_MSTMOD     (1UL << 2)
#define SPI_CTL0_SPIEN      (1UL << 6)
#define SPI_CTL0_LF         (1UL << 7)
#define SPI_CTL0_SWNSS      (1UL << 8)
#define SPI_CTL0_SWNSSEN    (1UL << 9)
#define SPI_CTL0_RO         (1UL << 10)
#define SPI_CTL0_FF16       (1UL << 11)

#define SPI_CTL1_DMAREN     (1UL << 0)
#define SPI_CTL1_DMATEN     (1UL << 1)
#define SPI_CTL1_NSSDRV     (1UL << 2)
#define SPI_CTL1_NSSP       (1UL << 3)
#define SPI_CTL1_ERRIE      (1UL << 5)
#define SPI_CTL1_RBNEIE     (1UL << 6)
#define SPI_CTL1_TBEIE      (1UL << 7)

#define SPI_STAT_RBNE       (1UL << 0)
#define SPI_STAT_TBE        (1UL << 1)
#define SPI_STAT_RXORERR    (1UL << 6)
#define SPI_STAT_TRANS      (1UL << 7) // Busy

#define I2S_CTL_CHLEN       (1UL << 0) // Sz of channel
#define I2S_CTL_CHLEN_16bit (0UL << 0)
#define I2S_CTL_CHLEN_32bit (1UL << 0)

#define I2S_CTL_DTLEN_msk   (0b11UL << 1) // Sz of payload data in channel
#define I2S_CTL_DTLEN_16bit (0b00UL << 1)
#define I2S_CTL_DTLEN_24bit (0b01UL << 1)
#define I2S_CTL_DTLEN_32bit (0b10UL << 1)

#define I2S_CTL_CKPL        (1UL << 3)
#define I2S_CTL_CKPL_IdleLo (0UL << 3)
#define I2S_CTL_CKPL_IdleHi (1UL << 3)

#define I2S_CTL_STD_msk     (0b11UL << 4)
#define I2S_CTL_STD_I2S     (0b00UL << 4)
#define I2S_CTL_STD_MSB     (0b01UL << 4)
#define I2S_CTL_STD_LSB     (0b10UL << 4)
#define I2S_CTL_STD_PCM     (0b11UL << 4)

#define I2S_CTL_SLAVE_TX    (0b00UL << 8)
#define I2S_CTL_SLAVE_RX    (0b01UL << 8)
#define I2S_CTL_MASTER_TX   (0b10UL << 8)
#define I2S_CTL_MASTER_RX   (0b11UL << 8)

#define I2S_CTL_I2SEN       (1UL << 10)
#define I2S_CTL_I2SSEL      (1UL << 11)

#define SPI_QCTL_IO23DR     (1UL << 2)
#define SPI_QCTL_QRD        (1UL << 1)
#define SPI_QCTL_QMOD       (1UL << 0)

struct SPI_TypeDef {
    volatile uint32_t CTL0;    /*!< Control register 0,      offset: 0x00 */
    volatile uint32_t CTL1;    /*!< Control register 1,      offset: 0x04 */
    volatile uint32_t STAT;    /*!< Status register,         offset: 0x08 */
    volatile uint32_t DATA;    /*!< Data register,           offset: 0x0C */
    volatile uint32_t CRCPOLY; /*!< CRC polynomial register, offset: 0x10 */
    volatile uint32_t RCRC;    /*!< RX CRC register,         offset: 0x14 */
    volatile uint32_t TCRC;    /*!< TX CRC register,         offset: 0x18 */
    volatile uint32_t I2SCTL;  /*!< I2S control register,    offset: 0x1C */
    volatile uint32_t I2SPSC;  /*!< I2S control register,    offset: 0x20 */
    volatile uint32_t resvd[23];
    volatile uint32_t QCTL;    /*!< Quad-SPI mode control register, Address offset: 0x80 */

