kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
    void Enable()  { CTL0 |=  SPI_CTL0_SPIEN; }
    void Disable() { CTL0 &= ~SPI_CTL0_SPIEN; }
    void EnableI2S()  { I2SCTL |=  I2S_CTL_I2SEN; }
    void DisableI2S() { I2SCTL &= ~I2S_CTL_I2SEN; }

    // IRQ
    void EnRxBufNotEmptyIrq()  { CTL1 |=  SPI_CTL1_RBNEIE; }
    void DisRxBufNotEmptyIrq() { CTL1 &= ~SPI_CTL1_RBNEIE; }

    // DMA
    void EnTxDma()    { CTL1 |=  SPI_CTL1_DMATEN; }
    void DisTxDma()   { CTL1 &= ~SPI_CTL1_DMATEN; }
    void EnRxDma()    { CTL1 |=  SPI_CTL1_DMAREN; }
    void DisRxDma()   { CTL1 &= ~SPI_CTL1_DMAREN; }
    void EnRxTxDma()  { CTL1 |=  (SPI_CTL1_DMATEN | SPI_CTL1_DMAREN); }
    void DisRxTxDma() { CTL1 &= ~(SPI_CTL1_DMATEN | SPI_CTL1_DMAREN); }

    // Flags and buf
    void WaitForTransLo() { while(STAT & SPI_STAT_TRANS); }
    void WaitForTBEHi()   { while(!(STAT & SPI_STAT_TBE)); }
    void WaitForRBNEHi()  { while(!(STAT & SPI_STAT_RBNE)); }
    void WaitForTBEHiAndTransLo() { while((STAT & (SPI_STAT_TBE | SPI_STAT_TRANS)) != SPI_STAT_TBE); }
    void ClearRxOvrErr()  { (void)DATA; (void)STAT; (void)DATA; }
};

#define SPI0    ((SPI_TypeDef*)SPI0_BASE)
#define SPI1    ((SPI_TypeDef*)SPI1_BASE)
#define SPI2    ((SPI_TypeDef*)SPI2_BASE)
#endif

#if 1 // =========================== Debug MCU =================================
struct DBGMCU_TypeDef {
    volatile uint32_t id;  /*!< 0x00 MCU device ID code */
    volatile uint32_t CTL; /*!< 0x04 Debug MCU configuration register */

    void StopTmrInDbg(const TIM_TypeDef *PTimer) {
        if     (PTimer == TIM0)  CTL |= 1UL << 10;
        else if(PTimer == TIM1)  CTL |= 1UL << 11;
        else if(PTimer == TIM2)  CTL |= 1UL << 12;
        else if(PTimer == TIM3)  CTL |= 1UL << 13;
        else if(PTimer == TIM4)  CTL |= 1UL << 17;
        else if(PTimer == TIM5)  CTL |= 1UL << 18;
        else if(PTimer == TIM6)  CTL |= 1UL << 19;
        else if(PTimer == TIM7)  CTL |= 1UL << 20;
        else if(PTimer == TIM8)  CTL |= 1UL << 28;
        else if(PTimer == TIM9)  CTL |= 1UL << 29;
        else if(PTimer == TIM10) CTL |= 1UL << 30;
        else if(PTimer == TIM11) CTL |= 1UL << 25;
        else if(PTimer == TIM12) CTL |= 1UL << 26;
        else if(PTimer == TIM13) CTL |= 1UL << 27;
    }
};

#define DBGMCU  ((DBGMCU_TypeDef*)DBG_BASE)
#endif

#if 1 // ===================== Reset and Clock Control =========================
// Clocks
#define RCU_IRC40K_FREQ_Hz      40000UL

// Bits
#define RCU_CTL_IRC8MEN         (1UL <<  0)
#define RCU_CTL_IRC8MSTB        (1UL <<  1)
#define RCU_CTL_HXTALEN         (1UL << 16)
#define RCU_CTL_HXTALSTB        (1UL << 17)
#define RCU_CTL_HXTALBPS        (1UL << 18)
#define RCU_CTL_CKMEN           (1UL << 19)
#define RCU_CTL_PLLEN           (1UL << 24)
#define RCU_CTL_PLLSTB          (1UL << 25)
#define RCU_CTL_PLL1EN          (1UL << 26)
#define RCU_CTL_PLL1STB         (1UL << 27)
#define RCU_CTL_PLL2EN          (1UL << 28)
#define RCU_CTL_PLL2STB         (1UL << 29)

#define RCU_CFG0_PLLSEL         (1UL << 16)
#define RCU_CFG1_PREDV0SEL      (1UL << 16)
#define RCU_CFG1_I2S1SEL        (1UL << 17)
#define RCU_CFG1_I2S2SEL        (1UL << 18)
#define RCU_CFG1_PLLPRESEL      (1UL << 30)

#define RCU_RSTSCK_IRC40KEN     (1UL << 0) // IRC40K enable
#define RCU_RSTSCK_IRC40KSTB    (1UL << 1) // IRC40K stabilization flag

#define RCU_ADDCTL_IRC48MEN     (1UL << 16)
#define RCU_ADDCTL_IRC48MSTB    (1UL << 17)
#define RCU_ADDCTL_CK48MSEL     (1UL <<  0)

#define CLK_STARTUP_TIMEOUT     99999UL  /*!< Simple loop delay count to allow clock to start */

enum class AhbPsc { div1=0, div2=0b1000, div4=0b1001 };
enum class PllMulti {
    mul02=0b00000, mul03=0b00001, mul04=0b00010, mul05=0b00011, mul06=0b00100, mul6d5=0b01101,
    mul07=0b00101, mul08=0b00110, mul09=0b00111, mul10=0b01000, mul11=0b01001,  mul12=0b01010,
    mul13=0b01011, mul14=0b01100, mul16=0b01110, mul17=0b10000, mul18=0b10001,  mul19=0b10010,
    mul20=0b10011, mul21=0b10100, mul22=0b10101, mul23=0b10110, mul24=0b10111,  mul25=0b11000,
    mul26=0b11001, mul27=0b11010, mul28=0b11011, mul29=0b11100, mul30=0b11101,  mul31=0b11110
};
enum class Pll2Multi {
    mul08=0b0110, mul09=0b0111, mul10=0b1000, mul11=0b1001,  mul12=0b1010,
    mul13=0b1011, mul14=0b1100, mul16=0b1110, mul20=0b1111
};
enum class UsbPsc : uint32_t {
    div1d5 = (0UL << 31) | (0b00UL << 22),
    div1   = (0UL << 31) | (0b01UL << 22),
    div2d5 = (0UL << 31) | (0b10UL << 22),
    div2   = (0UL << 31) | (0b11UL << 22),
    div3   = (1UL << 31) | (0b00UL << 22),
    div3d5 = (1UL << 31) | (0b01UL << 22),
    div4   = (1UL << 31) | (0b10UL << 22),
};

enum class AdcPsc : uint32_t {
    Apb2div2 = 0b0000, Apb2div4 = 0b0001, Apb2div6 = 0b0010, Apb2div8 = 0b0011,
    Apb2div12 = 0b0101, Apb2div16 = 0b0111,
    AHBdiv3 = 0b1000, AHBdiv5 = 0b1001, AHBdiv7 = 0b1010, AHBdiv9 = 0b1011
};

struct RCU_TypeDef {
    volatile uint32_t CTL;     // 0  Control register
    volatile uint32_t CFG0;    // 4  Clock configuration register 0
    volatile uint32_t INT;     // 8  Clock interrupt register
    volatile uint32_t APB2RST; // C
    volatile uint32_t APB1RST; // 10
    volatile uint32_t AHBEN;   // 14
    volatile uint32_t APB2EN;  // 18
    volatile uint32_t APB1EN;  // 1C
    volatile uint32_t BDCTL;   // 20
    volatile uint32_t RSTSCK;  // 24
    volatile uint32_t AHBRST;  // 28
    volatile uint32_t CFG1;    // 2C Clock configuration register 1
    volatile uint32_t _Reserved1;
    volatile uint32_t DSV;     // 34
    volatile uint32_t _Reserved2[34];
    volatile uint32_t ADDCTL;  // C0 Additional clock control register
    volatile uint32_t _Reserved3[2];
    volatile uint32_t ADDINT;  // CC
    volatile uint32_t _Reserved4[4];
    volatile uint32_t ADDAPB1RST; // E0
    volatile uint32_t ADDAPB1EN;  // E4

#if 1 // ==== XTAL, PLL etc. ====
    retv EnableIRC8M() {
        CTL |= RCU_CTL_IRC8MEN;
        for(uint32_t i=0; i<CLK_STARTUP_TIMEOUT; i++)
            if(CTL & RCU_CTL_IRC8MSTB) return retv::Ok;
        return retv::Timeout;
    }

    retv EnableXTAL() {
        CTL |= RCU_CTL_HXTALEN; // Enable XTAL
        for(uint32_t i=0; i<CLK_STARTUP_TIMEOUT; i++)
            if(CTL & RCU_CTL_HXTALSTB) return retv::Ok;
        return retv::Timeout;
    }

    retv EnablePll() {
        CTL |= RCU_CTL_PLLEN; // Enable PLL
        for(uint32_t i=0; i<CLK_STARTUP_TIMEOUT; i++)
            if(CTL & RCU_CTL_PLLSTB) return retv::Ok;
        return retv::Timeout;
    }

    retv EnablePll2() {
        CTL |= RCU_CTL_PLL2EN; // Enable PLL
        for(uint32_t i=0; i<CLK_STARTUP_TIMEOUT; i++)
            if(CTL & RCU_CTL_PLL2STB) return retv::Ok;
        return retv::Timeout;
    }

