kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
    retv EnableIRC48M() {
        ADDCTL |= RCU_ADDCTL_IRC48MEN;
        for(uint32_t i=0; i<CLK_STARTUP_TIMEOUT; i++)
            if(ADDCTL & RCU_ADDCTL_IRC48MSTB) return retv::Ok;
        return retv::Timeout;
    }

    void DisableAllClksExIrc8M() {
        CTL &= 0x0000FFFFUL; // PLL2, PLL1, PLL, CKM, XTAL
        ADDCTL &= ~RCU_ADDCTL_IRC48MEN;
    }

    void DisablePll2() { CTL &= ~RCU_CTL_PLL2EN; }


    void SetPllPresel_XTAL()     { CFG1 &= ~(1UL << 30); }
    void SetPllPresel_CKIRC48M() { CFG1 |=  (1UL << 30); }

    void SetPrediv0Sel_XTALorIRC48M() { CFG1 &= ~(1UL << 16); }
    void SetPrediv0Sel_CKPLL1()       { CFG1 |=  (1UL << 16); }

    // Div = [1; 16]
    void SetPrediv0(uint32_t Div) { SET_BITS(CFG1, 0b1111UL, ((Div - 1UL) & 0b1111UL), 0); }
    void SetPrediv1(uint32_t Div) { SET_BITS(CFG1, 0b1111UL, ((Div - 1UL) & 0b1111UL), 4); }

    void SetPllSel_Irc8Mdiv2() { CFG0 &= ~(1UL << 16); }
    void SetPllSel_Prediv0()   { CFG0 |=  (1UL << 16); }

    void SetPllMulti(PllMulti Multi) {
        uint32_t tmp = CFG0 & ~((1UL << 29) | (0b1111UL << 18));
        uint32_t m = (uint32_t)Multi;
        tmp |= ((m & 0b01111UL) << 18) | ((m & 0b10000UL) << 25); // 25 to put 5-th bit to 29 position
        CFG0 = tmp;
    }
    void SetPll2Multi(Pll2Multi Multi) { SET_BITS(CFG1, 0b1111UL, (uint32_t)Multi, 12); }

    // CkSys Switch
    uint32_t GetCkSwitchState() { return (CFG0 >> 2) & 0b11UL; }
    retv Switch2IRC8M() {
        SET_BITS(CFG0, 0b11UL, 0b00UL, 0); // Select IRC8M
        for(uint32_t i=0; i<CLK_STARTUP_TIMEOUT; i++)
            if(BITS_EQUAL(CFG0, 0b11UL, 0b00UL, 2)) return retv::Ok;
        return retv::Timeout;
    }
    retv SwitchCkSys2PLL() {
        SET_BITS(CFG0, 0b11UL, 0b10UL, 0); // Select PLL
        for(uint32_t i=0; i<CLK_STARTUP_TIMEOUT; i++)
            if(BITS_EQUAL(CFG0, 0b11UL, 0b10UL, 2)) return retv::Ok;
        return retv::Timeout;
    }
    retv SwitchCkSys2XTAL() {
        SET_BITS(CFG0, 0b11UL, 0b01UL, 0); // Select XTAL
        for(uint32_t i=0; i<CLK_STARTUP_TIMEOUT; i++)
            if(BITS_EQUAL(CFG0, 0b11UL, 0b01UL, 2)) return retv::Ok;
        return retv::Timeout;
    }

    void SetAhbPrescaler(AhbPsc Div) { SET_BITS(CFG0, 0b1111UL, (uint32_t)Div, 4); }

    // USB: the USBFS clock must be 48MHz. Do not touch if USBFS clk is enabled.
    void SetUsbPrescaler(UsbPsc Div) { CFG0 = (CFG0 & ~((1UL << 31) | (0b11UL << 22))) | (uint32_t)Div; }
    void SetCK48MSel_CKPLL()    { ADDCTL &= ~RCU_ADDCTL_CK48MSEL; }
    void SetCK48MSel_CKIRC48M() { ADDCTL |=  RCU_ADDCTL_CK48MSEL; }
#endif

#if 1 // ==== Enable periperial blocks ====
    void EnDMAs() { AHBEN |= (1UL << 0) | (1UL << 1); }
    void EnUSB()  { AHBEN |= 1UL << 12; }
    void EnCRC()  { AHBEN |= 1UL << 6;  }

    void EnAFIO() { APB2EN |= 1UL <<  0; }
    void EnADC0() { APB2EN |= 1UL <<  9; }
    void EnADC1() { APB2EN |= 1UL << 10; }

    void EnI2C0() { APB1EN |= 1UL << 21; }
    void EnI2C1() { APB1EN |= 1UL << 22; }
    void EnBckp() { APB1EN |= 1UL << 27; }
    void EnPwrMgmtUnit() { APB1EN |= 1UL << 28; }
    void EnDAC()  { APB1EN |= 1UL << 29; }

    void EnCTC()  { ADDAPB1EN |= 1UL << 27; }

    void EnUart(const USART_TypeDef* PUart) {
        if     (PUart == USART0) APB2EN |= 1UL << 14;
        else if(PUart == USART1) APB1EN |= 1UL << 17;
        else if(PUart == USART2) APB1EN |= 1UL << 18;
        else if(PUart == UART3)  APB1EN |= 1UL << 19;
        else if(PUart == UART4)  APB1EN |= 1UL << 20;
    }

    void EnGpio(const GPIO_TypeDef *pgpio) {
        if     (pgpio == GPIOA) APB2EN |= 1UL << 2;
        else if(pgpio == GPIOB) APB2EN |= 1UL << 3;
        else if(pgpio == GPIOC) APB2EN |= 1UL << 4;
        else if(pgpio == GPIOD) APB2EN |= 1UL << 5;
        else if(pgpio == GPIOE) APB2EN |= 1UL << 6;
    }

    void EnTimer(const TIM_TypeDef *PTimer) {
        if     (PTimer == TIM0)  APB2EN |= 1UL << 11;
        else if(PTimer == TIM1)  APB1EN |= 1UL <<  0;
        else if(PTimer == TIM2)  APB1EN |= 1UL <<  1;
        else if(PTimer == TIM3)  APB1EN |= 1UL <<  2;
        else if(PTimer == TIM4)  APB1EN |= 1UL <<  3;
        else if(PTimer == TIM5)  APB1EN |= 1UL <<  4;
        else if(PTimer == TIM6)  APB1EN |= 1UL <<  5;
        else if(PTimer == TIM7)  APB2EN |= 1UL << 13;
        else if(PTimer == TIM8)  APB2EN |= 1UL << 19;
        else if(PTimer == TIM9)  APB2EN |= 1UL << 20;
        else if(PTimer == TIM10) APB2EN |= 1UL << 21;
        else if(PTimer == TIM11) APB1EN |= 1UL <<  6;
        else if(PTimer == TIM12) APB1EN |= 1UL <<  7;
        else if(PTimer == TIM13) APB1EN |= 1UL <<  8;
    }

    void EnSpi(const SPI_TypeDef *PSpi) {
        if     (PSpi == SPI0) APB2EN |= 1UL << 12;
        else if(PSpi == SPI1) APB1EN |= 1UL << 14;
        else if(PSpi == SPI2) APB1EN |= 1UL << 15;
    }
#endif

#if 1 // ==== Disable periperial blocks ====
    void DisAllPeriph() {
        AHBEN = 0;
        APB1EN = 0;
        APB2EN = 0;
        ADDAPB1EN = 0;
    }

    void DisUSB()  { AHBEN  &= ~(1UL << 12); }
    void DisI2C0() { APB1EN &= ~(1UL << 21); }
    void DisI2C1() { APB1EN &= ~(1UL << 22); }

    void DisTimer(const TIM_TypeDef *PTimer) {
        if     (PTimer == TIM0)  APB2EN &= ~(1UL << 11);
        else if(PTimer == TIM1)  APB1EN &= ~(1UL <<  0);
        else if(PTimer == TIM2)  APB1EN &= ~(1UL <<  1);
        else if(PTimer == TIM3)  APB1EN &= ~(1UL <<  2);
        else if(PTimer == TIM4)  APB1EN &= ~(1UL <<  3);
        else if(PTimer == TIM5)  APB1EN &= ~(1UL <<  4);
        else if(PTimer == TIM6)  APB1EN &= ~(1UL <<  5);
        else if(PTimer == TIM7)  APB2EN &= ~(1UL << 13);
        else if(PTimer == TIM8)  APB2EN &= ~(1UL << 19);
        else if(PTimer == TIM9)  APB2EN &= ~(1UL << 20);
        else if(PTimer == TIM10) APB2EN &= ~(1UL << 21);
        else if(PTimer == TIM11) APB1EN &= ~(1UL <<  6);
        else if(PTimer == TIM12) APB1EN &= ~(1UL <<  7);
        else if(PTimer == TIM13) APB1EN &= ~(1UL <<  8);
    }
#endif

