kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
#if 1 // ==== Reset ====
    void ResetAll() {
        AHBRST = 0xFFFFFFFF;
        AHBRST = 0x00000000;
        (void)AHBRST; // Perform dummy read
        APB1RST = 0xFFFFFFFF;
        APB1RST = 0x00000000;
        (void)APB1RST;
        APB2RST = 0xFFFFFFFF;
        APB2RST = 0x00000000;
        (void)APB2RST;
        ADDAPB1RST = 0xFFFFFFFF;
        ADDAPB1RST = 0x00000000;
        (void)ADDAPB1RST;
    }

    void ResI2C0() {
        APB1RST |=  (1UL << 21);
        APB1RST &= ~(1UL << 21);
        (void)APB1RST;
    }
    void ResI2C1() {
        APB1RST |=  (1UL << 22);
        APB1RST &= ~(1UL << 22);
        (void)APB1RST;
    }

    void ResUSB() {
        AHBRST |=  (1UL << 12);
        AHBRST &= ~(1UL << 12);
        (void)AHBRST; // Perform dummy read
    }

    void ResCTC()  {
        ADDAPB1RST = 1UL << 27;
        ADDAPB1RST = 0;
        (void)ADDAPB1RST; // Perform dummy read
    }
#endif
    // ADC clock must be within [0.1; 40] MHz
    void SetAdcPsc(AdcPsc Psc) {
        uint32_t w = (uint32_t)Psc;
        // Put Psc[2] to bit 28, Psc[1:0] to bits [15:14] of CFG0
        uint32_t tmp = CFG0 & ~((1UL << 28) | (1UL << 15) | (1UL << 14));
        tmp |= (w & 0b0011UL) << 14;
        if(w & 0b0100UL) tmp |= (1UL << 28);
        CFG0 = tmp;
        // Put Psc[3] to bit 29 of CFG1
        if(w & 0b1000UL) CFG1 |= (1UL << 29);
        else CFG1 &= ~(1UL << 29);
    }

#if 1 // ==== Get ====
    uint32_t GetCkSys() {
        uint32_t CkSysSrc = GET_BITS(CFG0, 0b11UL, 2);
        if(CkSysSrc == 0b01UL) return CRYSTAL_FREQ_HZ; // Ext crystal
        else if(CkSysSrc == 0b10UL) { // PLL
            uint32_t PllSrcFreqHz;
            if((CFG0 & RCU_CFG0_PLLSEL) == 0) PllSrcFreqHz = IRC8M_Hz / 2UL;
            else { // Prediv0 is src
                // Get Prediv0InputFreq
                uint32_t Prediv0InputFreq;
                if((CFG1 & RCU_CFG1_PREDV0SEL) == 0) {
                    if(CFG1 & RCU_CFG1_PLLPRESEL) Prediv0InputFreq = IRC48M_Hz; // PLLPRESEL == 1
                    else Prediv0InputFreq = CRYSTAL_FREQ_HZ; // PLLPRESEL == 0
                }
                else { // Predv0Sel == 1 => Prediv0InputFreq is output of PLL1
                    // Get PLL1 multi
                    uint32_t Pll1Mf = GET_BITS(CFG1, 0b1111UL, 8);
                    uint32_t Pll1Multi = 0;
                    if(Pll1Mf >= 0b0110UL) Pll1Multi = Pll1Mf + 2UL; // lower values are reserved
                    if(Pll1Mf == 0b1101UL) Pll1Multi = 0;   // 1101 is reserved
                    if(Pll1Mf == 0b1111UL) Pll1Multi = 20;  // 1111 is special case
                    // Get PLL1 div
                    uint32_t Prediv1 = GET_BITS(CFG1, 0b1111UL, 4) + 1UL;
                    // Get PLL1 src:
                    uint32_t Prediv1InputFreq = (CFG1 & RCU_CFG1_PLLPRESEL)? IRC48M_Hz : CRYSTAL_FREQ_HZ;
                    // Calculate Prediv0InputFreq
                    Prediv0InputFreq = Pll1Multi * (Prediv1InputFreq / Prediv1);
                }
                // Calculate PllSrcFreqHz
                uint32_t Prediv0 = GET_BITS(CFG1, 0b1111UL, 0) + 1UL;
                PllSrcFreqHz = Prediv0InputFreq / Prediv0;
            }
            // Calculate CkSysHz
            uint32_t PllMf = GET_BITS(CFG0, 0b1111UL, 18) | (GET_BITS(CFG0, 1UL, 29) << 4);
            if     (PllMf <= 0b01100UL) return PllSrcFreqHz * (PllMf + 2UL); // Multi = [2; 14]
            else if(PllMf == 0b01101UL) return (PllSrcFreqHz * 13UL) / 2UL;  // Multi = 6.5
            else if(PllMf == 0b01110UL) return PllSrcFreqHz * 16UL;          // Multi = 16
            else if(PllMf == 0b11111UL) return PllSrcFreqHz * 31UL;          // Multi = 31
            else                        return PllSrcFreqHz * (PllMf + 1UL); // PllMf == [01111; 11110] => Multi = [16; 31]
        }
        else return IRC8M_Hz; // for 00 and 11
    }
#endif // Get
};

#define RCU     ((RCU_TypeDef*)RCU_BASE)
#endif // RCU

#if 1 // ================== Clock trim controller (CTC) ========================
// For detailed description, see User Manual CTC Software program guide, p.108
#define CTC_FCLOCK_HZ           48000000UL // 48MHz of IRC48M
#define CTC_RVALUE(Fref_Hz)     ((CTC_FCLOCK_HZ / Fref_Hz) - 1UL)
#define CTC_CKLIM(Fref_Hz)      ((((CTC_FCLOCK_HZ / Fref_Hz) * 12UL) / 10000UL) / 2UL)

#define CTC_CTL0_AUTOTRIM       (1UL << 6)
#define CTC_CTL0_CNTEN          (1UL << 5)

#define CTC_REFPOL_RISING       (0UL << 31)
#define CTC_REFPOL_FALLING      (1UL << 31)
#define CTC_REFSEL_GPIO         (0b00UL << 28)
#define CTC_REFSEL_LXTAL        (0b01UL << 28)
#define CTC_REFSEL_USBSOF       (0b10UL << 28)

#define CTC_REFPSC_DIV_1        (0b000UL << 24)
#define CTC_REFPSC_DIV_2        (0b001UL << 24)
#define CTC_REFPSC_DIV_4        (0b010UL << 24)
#define CTC_REFPSC_DIV_8        (0b011UL << 24)
#define CTC_REFPSC_DIV_16       (0b100UL << 24)
#define CTC_REFPSC_DIV_32       (0b101UL << 24)
#define CTC_REFPSC_DIV_64       (0b110UL << 24)
#define CTC_REFPSC_DIV_128      (0b111UL << 24)

struct CTC_Typedef {
    volatile uint32_t CTL0;  /*!< 0x00 Control register 0 */
    volatile uint32_t CTL1;  /*!< 0x04 Control register 1 */
    volatile uint32_t STAT;  /*!< 0x08 Status register */
    volatile uint32_t INTC;  /*!< 0x0C Interrupt clear register */

    void Setup(uint32_t RefPol, uint32_t RefSel, uint32_t RefPsc, uint32_t Fref) {
        CTL1 = RefPol | RefSel | RefPsc | (CTC_CKLIM(Fref) << 16) | CTC_RVALUE(Fref);
        CTL0 |= CTC_CTL0_AUTOTRIM; // Enable autotrim. Otherwise, what's the point?
    }

    void Enable()  { CTL0 |=  CTC_CTL0_CNTEN; }
    void Disable() { CTL0 &= ~CTC_CTL0_CNTEN; }
};

#define CTC     ((CTC_Typedef*)CTC_BASE)
#endif

#if 1 // ============================= Flash ===================================
#define FMC_WS_PGW          (1UL << 15) // Program width to flash memory: 0 is 32bit (default), 1 is 64bit
#define FMC_WS_DCRST        (1UL << 12) // DBUS cache reset. This bit can be write only when DCEN is set to 0
#define FMC_WS_ICRST        (1UL << 11) // IBUS cache reset. This bit can be write only when ICEN is set to 0
#define FMC_WS_DCEN         (1UL << 10) // DBUS cache enable
#define FMC_WS_ICEN         (1UL <<  9) // IBUS cache enable
#define FMC_WS_PFEN         (1UL <<  4) // Pre-fetch enable
#define FMC_WS_WSCNT_MSK    (7UL <<  0) // Wait state mask

#define FMC_STAT_ENDF       (1UL << 5) // End of operation flag
#define FMC_STAT_WPERR      (1UL << 4) // Erase/Program protection error flag
#define FMC_STAT_PGAERR     (1UL << 3) // Program alignment error flag
#define FMC_STAT_PGERR      (1UL << 2) // Program error flag
#define FMC_STAT_BUSY       (1UL << 0) // The flash is busy

#define FMC_CTL_OBWEN       (1UL << 9) // Option byte erase/program enable bit
#define FMC_CTL_LK          (1UL << 7) // FMC_CTL lock bit
#define FMC_CTL_START       (1UL << 6) // Send erase command to FMC bit
#define FMC_CTL_OBER        (1UL << 5) // Option bytes erase command bit
#define FMC_CTL_OBPG        (1UL << 4) // Option bytes program command bit
#define FMC_CTL_MER         (1UL << 2) // Main flash mass erase for bank0 command bit
#define FMC_CTL_PER         (1UL << 1) // Main flash page erase for bank0 command bit
#define FMC_CTL_PG          (1UL << 0) // Main flash program for bank0 command bit

struct FMC_TypeDef {
    volatile uint32_t WS;     /*!< 0x00  Wait state register */
    volatile uint32_t KEY;    /*!< 0x04  Unlock key register */
    volatile uint32_t OBKEY;  /*!< 0x08  Option byte unlock key register */
    volatile uint32_t STAT;   /*!< 0x0C  Status register */
    volatile uint32_t CTL;    /*!< 0x10 Control register */
    volatile uint32_t ADDR;   /*!< 0x14 Address register */
    volatile uint32_t _Reserved1; // 18
    volatile uint32_t OBSTAT; /*!< 0x1C Option byte status register */
    volatile uint32_t WP;     /*!< 0x20  Erase/Program protection register */
    volatile uint32_t _Reserved[55];
    volatile uint32_t PID;     /*!< 0x100 Product ID register */

    void EnableCashAndPrefetch() { WS |= (1UL<<10)|(1UL<<9)|(1UL<<4); }

    void SetLatency(uint32_t Clk_MHz) {
        uint32_t tmp = WS & ~FMC_WS_WSCNT_MSK; // Clean last 3 bits
        if     (Clk_MHz <=  30) tmp |= 0UL; // Add 0 wait state
        else if(Clk_MHz <=  60) tmp |= 1UL; // Add 1 wait state
        else if(Clk_MHz <=  90) tmp |= 2UL; // Add 2 wait state
        else if(Clk_MHz <= 120) tmp |= 3UL; // Add 3 wait state
        WS = tmp;
    }
};

#define FMC     ((FMC_TypeDef*)FMC_BASE)
#endif

#if 1 // ======================= Option Bytes ==================================
struct OPTB_Typedef {
    union {
        volatile uint32_t SPC_USER32;
        struct {
            volatile uint8_t SPC;   // Security Protection value
            volatile uint8_t SPC_N; // SPC complement value
            volatile uint8_t USER;  // nRST_STDBY, nRST_DPSLP, nWDG_HW
            volatile uint8_t USER_N;
        };
    };
};

#define OPTBYTES    ((OPTB_Typedef*)OB_BASE)
#endif

#if 1 // ============================= USB =====================================
// Resources
#define USBFS_MAX_TX_FIFOS      15U         /*!< FIFO number */
//#define USBFS_MAX_PACKET_SIZE   64U
#define USBFS_MAX_CHANNEL_COUNT 8U          /*!< USBFS host channel count */
#define USBFS_MAX_EP_COUNT      4U          /*!< USBFS device endpoint count, including EP0 */
#define USBFS_MAX_FIFO_WORDLEN  320U        /*!< USBFS max fifo size in words */

