kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
#define USB_DATA_FIFO_OFFSET    0x1000U
#define USB_DATA_FIFO_SIZE      0x1000U

// Bits
#define GUSBCS_FDM              (1U<<30)    // Force Device Mode
#define GUSBCS_FHM              (1U<<29)    // Force Host Mode
#define GUSBCS_UTT(n)           ((n)<<10)   // USB Turnaround time field value
#define GUSBCS_UTT_MASK         (0xFUL<<10)
#define GUSBCS_EMBPHY           (1UL<<6) // Not used in E113, but who knows

#define GRSTCTL_CSRST           (1UL<<0)
#define GRSTCTL_RXFF            (1U<<4)     /**< RxFIFO flush.              */
#define GRSTCTL_TXFF            (1U<<5)     /**< TxFIFO flush.              */
#define GRSTCTL_TXFNUM(n)       ((n)<<6)    /**< TxFIFO number field value. */

#define GAHBCS_GINTEN           (1U<< 0) // Global interrupt mask

#define GINTF_SOF               (1UL<< 3) // Start of frame
#define GINTF_RXFNEIF           (1UL<< 4) // Rx FIFO non-empty interrupt flag
#define GINTF_SP                (1UL<<11) // USB suspend
#define GINTF_RST               (1UL<<12) // USB reset
#define GINTF_ENUMF             (1UL<<13) // Enumeration finished
#define GINTF_IEPIF             (1UL<<18) // IN endpoint interrupt flag
#define GINTF_OEPIF             (1UL<<19) // OUT endpoint interrupt flag
#define GINTF_ISOINCIF          (1UL<<20) // Isochronous IN transfer not complete interrupt flag
#define GINTF_ISOONCIF          (1UL<<21) // Isochronous OUT transfer not complete interrupt flag
#define GINTF_WKUPIF            (1UL<<31) // Wakeup interrupt flag

#define GINTEN_MFIE             (1UL<< 1) // Mode fault interrupt enable
#define GINTEN_OTGIE            (1UL<< 2) // OTG interrupt enable
#define GINTEN_SOFIE            (1UL<< 3) // Start of frame interrupt enable
#define GINTEN_RXFNEIE          (1UL<< 4) // Receive FIFO non-empty interrupt enable
#define GINTEN_NPTXFEIE         (1UL<< 5) // Non-periodic Tx FIFO empty interrupt enable
#define GINTEN_GNPINAKIE        (1UL<< 6) // Global non-periodic IN NAK effective interrupt enable
#define GINTEN_GONAKIE          (1UL<< 7) // Global OUT NAK effective interrupt enable
#define GINTEN_ESPIE            (1UL<<10) // Early suspend interrupt enable
#define GINTEN_SPIE             (1UL<<11) // USB suspend interrupt enable
#define GINTEN_RSTIE            (1UL<<12) // USB reset interrupt enable
#define GINTEN_ENUMFIE          (1UL<<13) // Enumeration finish enable
#define GINTEN_ISOOPDIE         (1UL<<14) // Isochronous OUT packet dropped interrupt enable
#define GINTEN_EOPFIE           (1UL<<15) // End of periodic frame interrupt enable
#define GINTEN_IEPIE            (1UL<<18) // IN endpoints interrupt enable
#define GINTEN_OEPIE            (1UL<<19) // OUT endpoints interrupt enable
#define GINTEN_ISOINCIE         (1UL<<20) // Isochronous IN transfer not complete interrupt enable
#define GINTEN_ISOONCIE         (1UL<<21) // Isochronous OUT transfer not complete interrupt enable
#define GINTEN_PXNCIE           (1UL<<21) // Yes, 21. Periodic transfer not complete Interrupt enable
#define GINTEN_HPIE             (1UL<<24) // Host port interrupt enable
#define GINTEN_HCIE             (1UL<<25) // Host channels interrupt enable
#define GINTEN_PTXFEIE          (1UL<<26) // Periodic Tx FIFO empty interrupt enable
#define GINTEN_IDPSCIE          (1UL<<28) // ID pin status change interrupt enable
#define GINTEN_DISCIE           (1UL<<29) // Disconnected interrupt enable
#define GINTEN_SESIE            (1UL<<30) // Session interrupt enable
#define GINTEN_WKUPIE           (1UL<<31) // Wakeup interrupt enable

#define GRSTATP_PKTSTS_MASK     (0xFUL<<17) // Packet status mask
#define GRSTATP_PKTSTS(n)       ((n)<<17)   // Packet status value
#define GRSTATP_OUT_GLOBAL_NAK  GRSTATP_PKTSTS(1)
#define GRSTATP_OUT_DATA        GRSTATP_PKTSTS(2)
#define GRSTATP_OUT_COMP        GRSTATP_PKTSTS(3)
#define GRSTATP_SETUP_COMP      GRSTATP_PKTSTS(4)
#define GRSTATP_SETUP_DATA      GRSTATP_PKTSTS(6)
#define GRSTATP_BCNT_MASK       (0x7FFUL<<4) // Byte count mask
#define GRSTATP_BCNT_OFFSET     4           // Byte count offset
#define GRSTATP_BCNT(n)         ((n)<<4)    // Byte count value
#define GRSTATP_EPNUM_MASK      0xFUL       // Endpoint number mask
#define GRSTATP_EPNUM_OFFSET    0           // Endpoint number offset
#define GRSTATP_EPNUM(n)        ((n)<<0)    // Endpoint number value

#define DIEPTFLEN_IEPTXFD_MASK   (0xFFFFU<<16) // IN endpoint TxFIFO depth mask
#define DIEPTFLEN_IEPTXFD(n)     ((n)<<16)   // IN endpoint TxFIFO depth value
#define DIEPTFLEN_IEPTXRSAR_MASK (0xFFFF<<0) // IN endpoint FIFOx transmit RAM start address mask
#define DIEPTFLEN_IEPTXRSAR(n)   ((n)<<0)    // IN endpoint FIFOx transmit RAM start address value

#define GCCFG_VBUSIG            (1UL<<21)   // VBUS ignored
#define GCCFG_SOFOEN            (1UL<<20)   // SOF output enable
#define GCCFG_VBUSBCEN          (1UL<<19)   // The VBUS B-Device comparer enable
#define GCCFG_VBUSACEN          (1UL<<18)   // The VBUS A-Device comparer enable
#define GCCFG_PWRON             (1UL<<16)

#define DCFG_DSPD_FS11          (3U<<0)     /**< Full speed (USB 1.1 transceiver clock is 48MHz) */
#define DCFG_DAD_MASK           (0x7FU<<4)  /**< Device address mask.       */
#define DCFG_DAD(n)             ((n)<<4)    /**< Device address value.      */

#define DCTL_RWKUP              (1U<<0)     // Remote wakeup signaling
#define DCTL_SD                 (1U<<1)     // Soft disconnect

#define DSTS_SUSPSTS            (1U<<0)     /**< Suspend status.            */
#define DSTS_ENUMSPD_MASK       (3U<<1)     /**< Enumerated speed mask.     */
#define DSTS_ENUMSPD_HS_480     (0U<<1)     /**< High speed.                */
#define DSTS_ENUMSPD_FS_48      (3U<<1)     /**< Full speed (PHY clock is running at 48 MHz).        */
#define DSTS_EERR               (1U<<3)     /**< Erratic error.             */
#define DSTS_FNSOF_MASK         (0x3FFU<<8) // Frame number of the received SOF mask
#define DSTS_FNSOF(n)           ((n)<<8)    // Frame number of the received SOF value
#define DSTS_FNSOF_ODD          (1U<<8)     // Frame parity of the received SOF value

#define DIEPMSK_TXFEM           (1U<<6)     /**< Transmit FIFO empty mask.  */
#define DIEPMSK_INEPNEM         (1U<<6)     // IN endpoint NAK effective mask
#define DIEPMSK_ITTXFEMSK       (1U<<4)     // IN token received when TxFIFO empty mask
#define DIEPMSK_TOCM            (1U<<3)     /**< Timeout condition mask.    */
#define DIEPMSK_EPDM            (1U<<1)     // Endpoint disabled interrupt mask
#define DIEPMSK_XFRCM           (1U<<0)     // Transfer completed interrupt mask

#define DOEPMSK_OTEPDM          (1U<<4)     // OUT token received when endpoint disabled mask
#define DOEPMSK_STUPM           (1U<<3)     // SETUP phase done mask
#define DOEPMSK_EPDM            (1U<<1)     // Endpoint disabled interrupt mask
#define DOEPMSK_XFRCM           (1U<<0)     // Transfer completed interrupt mask

