kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
#define DAINTMSK_OEPM(n)        (1U<<(16+(n))) /**< OUT EP interrupt mask bits value */
#define DAINTMSK_IEPM(n)        (1U<<(n))   // IN EP interrupt mask bits value

#define DIEPEMPMSK_INEPTXFEM(n) (1U<<(n))   // IN EP Tx FIFO empty interrupt mask bit

#define DTXFSTS_INEPTFSAV_MASK  0xFFFFUL    // IN endpoint TxFIFO space available

#define DIEPCTL_EPENA           (1U<<31)    /**< Endpoint enable.           */
#define DIEPCTL_EPDIS           (1U<<30)    /**< Endpoint disable.          */
#define DIEPCTL_SD1PID          (1U<<29)    /**< Set DATA1 PID.             */
#define DIEPCTL_SODDFRM         (1U<<29)    /**< Set odd frame.             */
#define DIEPCTL_SD0PID          (1U<<28)    /**< Set DATA0 PID.             */
#define DIEPCTL_SEVNFRM         (1U<<28)    /**< Set even frame.            */
#define DIEPCTL_SNAK            (1U<<27)    /**< Set NAK.                   */
#define DIEPCTL_CNAK            (1U<<26)    /**< Clear NAK.                 */
#define DIEPCTL_TXFNUM_MASK     (15U<<22)   /**< TxFIFO number mask.        */
#define DIEPCTL_TXFNUM(n)       ((n)<<22)   /**< TxFIFO number value.       */
#define DIEPCTL_STALL           (1U<<21)    /**< STALL handshake.           */
#define DIEPCTL_SNPM            (1U<<20)    /**< Snoop mode.                */
#define DIEPCTL_EPTYP_MASK      (3<<18)     /**< Endpoint type mask.        */
#define DIEPCTL_EPTYP_CTRL      (0U<<18)    /**< Control.                   */
#define DIEPCTL_EPTYP_ISO       (1U<<18)    /**< Isochronous.               */
#define DIEPCTL_EPTYP_BULK      (2U<<18)    /**< Bulk.                      */
#define DIEPCTL_EPTYP_INTR      (3U<<18)    /**< Interrupt.                 */
#define DIEPCTL_NAKSTS          (1U<<17)    /**< NAK status.                */
#define DIEPCTL_EONUM           (1U<<16)    /**< Even/odd frame.            */
#define DIEPCTL_DPID            (1U<<16)    /**< Endpoint data PID.         */
#define DIEPCTL_USBAEP          (1U<<15)    /**< USB active endpoint.       */
#define DIEPCTL_MPSIZ_MASK      (0x3FFU<<0) /**< Maximum Packet size mask.  */
#define DIEPCTL_MPSIZ(n)        ((n)<<0)    /**< Maximum Packet size value. */

#define DOEPCTL_EPENA           (1U<<31)    /**< Endpoint enable.           */
#define DOEPCTL_EPDIS           (1U<<30)    /**< Endpoint disable.          */
#define DOEPCTL_SD1PID          (1U<<29)    /**< Set DATA1 PID.             */
#define DOEPCTL_SODDFRM         (1U<<29)    /**< Set odd frame.             */
#define DOEPCTL_SD0PID          (1U<<28)    /**< Set DATA0 PID.             */
#define DOEPCTL_SEVNFRM         (1U<<28)    /**< Set even frame.            */
#define DOEPCTL_SNAK            (1U<<27)    /**< Set NAK.                   */
#define DOEPCTL_CNAK            (1U<<26)    /**< Clear NAK.                 */
#define DOEPCTL_STALL           (1U<<21)    /**< STALL handshake.           */
#define DOEPCTL_SNPM            (1U<<20)    /**< Snoop mode.                */
#define DOEPCTL_EPTYP_MASK      (3U<<18)    /**< Endpoint type mask.        */
#define DOEPCTL_EPTYP_CTRL      (0U<<18)    /**< Control.                   */
#define DOEPCTL_EPTYP_ISO       (1U<<18)    /**< Isochronous.               */
#define DOEPCTL_EPTYP_BULK      (2U<<18)    /**< Bulk.                      */
#define DOEPCTL_EPTYP_INTR      (3U<<18)    /**< Interrupt.                 */
#define DOEPCTL_NAKSTS          (1U<<17)    /**< NAK status.                */
#define DOEPCTL_EONUM           (1U<<16)    /**< Even/odd frame.            */
#define DOEPCTL_DPID            (1U<<16)    /**< Endpoint data PID.         */
#define DOEPCTL_USBAEP          (1U<<15)    /**< USB active endpoint.       */
#define DOEPCTL_MPSIZ_MASK      (0x3FFU<<0) /**< Maximum Packet size mask.  */
#define DOEPCTL_MPSIZ(n)        ((n)<<0)    /**< Maximum Packet size value. */

#define DIEPINT_TXFE            (1U<<7)     // Transmit FIFO empty
#define DIEPINT_INEPNE          (1U<<6)     // IN endpoint NAK effective
#define DIEPINT_ITTXFE          (1U<<4)     // IN Token received when TxFIFO is empty
#define DIEPINT_TOC             (1U<<3)     // Timeout condition
#define DIEPINT_EPDISD          (1U<<1)     // Endpoint disabled interrupt
#define DIEPINT_XFRC            (1U<<0)     // Transfer completed

#define DOEPINT_SETUP_RCVD      (1U<<15)    // SETUP packet received
#define DOEPINT_B2BSTUP         (1U<<6)     // Back-to-back SETUP packets received
#define DOEPINT_OTEPDIS         (1U<<4)     // OUT token received when endpoint disabled
#define DOEPINT_STUP            (1U<<3)     // SETUP phase done
#define DOEPINT_EPDISD          (1U<<1)     // Endpoint disabled  interrupt
#define DOEPINT_XFRC            (1U<<0)     // Transfer completed interrupt

#define DOEPTSIZ_RXDPID_MASK    (3U<<29)    /**< Received data PID mask.    */
#define DOEPTSIZ_RXDPID(n)      ((n)<<29)   /**< Received data PID value.   */
#define DOEPTSIZ_STUPCNT_MASK   (3U<<29)    /**< SETUP packet count mask.   */
#define DOEPTSIZ_STUPCNT(n)     ((n)<<29)   /**< SETUP packet count value.  */
#define DOEPTSIZ_PKTCNT_MASK    (0x3FFU<<19)/**< Packet count mask.         */
#define DOEPTSIZ_PKTCNT(n)      ((n)<<19)   /**< Packet count value.        */
#define DOEPTSIZ_XFRSIZ_MASK    (0x7FFFFU<<0)/**< Transfer size mask.       */
#define DOEPTSIZ_XFRSIZ(n)      ((n)<<0)    /**< Transfer size value.       */

#define DIEPTSIZ_MCNT_MASK      (3U<<29)    /**< Multi count mask.          */
#define DIEPTSIZ_MCNT(n)        ((n)<<29)   /**< Multi count value.         */
#define DIEPTSIZ_PKTCNT_MASK    (0x3FF<<19) /**< Packet count mask.         */
#define DIEPTSIZ_PKTCNT(n)      ((n)<<19)   /**< Packet count value.        */
#define DIEPTSIZ_XFRSIZ_MASK    (0x7FFFFU<<0)/**< Transfer size mask.       */
#define DIEPTSIZ_XFRSIZ(n)      ((n)<<0)    /**< Transfer size value.       */

#define PWRCLKCTL_SHCLK         (1UL<<1) // Stop HCLK
#define PWRCLKCTL_SUCLK         (1UL<<0) // Stop SUCLK

// Host channel registers group.
struct UsbHostChnl_TypeDef {
    volatile uint32_t HCCHAR;     /**< @brief Host channel characteristics register */
    volatile uint32_t resvd8;
    volatile uint32_t HCINT;      /**< @brief Host channel interrupt register.*/
    volatile uint32_t HCINTMSK;   /**< @brief Host channel interrupt mask register */
    volatile uint32_t HCTSIZ;     /**< @brief Host channel transfer size register */
    volatile uint32_t resvd14;
    volatile uint32_t resvd18;
    volatile uint32_t resvd1c;
};

// Device input endpoint registers group.
struct UsbInEp_Typedef {
    volatile uint32_t DIEPCTL;    /**< @brief Device control IN endpoint control register */
    volatile uint32_t resvd4;
    volatile uint32_t DIEPINT;    /**< @brief Device IN endpoint interrupt register */
    volatile uint32_t resvdC;
    volatile uint32_t DIEPLEN;   /**< @brief Device IN endpoint transfer size register */
    volatile uint32_t resvd14;
    volatile uint32_t DIEPTFSTAT;    /**< @brief Device IN endpoint transmit FIFO status register */
    volatile uint32_t resvd1C;
};

// Device output endpoint registers group.
struct UsbOutEp_Typedef {
    volatile uint32_t DOEPCTL;    /**< @brief Device control OUT endpoint control register */
    volatile uint32_t resvd4;
    volatile uint32_t DOEPINTF;    /**< @brief Device OUT endpoint interrupt register */
    volatile uint32_t resvdC;
    volatile uint32_t DOEPTSIZ;   /**< @brief Device OUT endpoint transfer size register */
    volatile uint32_t resvd14;
    volatile uint32_t resvd18;
    volatile uint32_t resvd1C;
};

struct USB_Typedef {
    volatile uint32_t GOTGCS;    /**< @brief OTG control and status register.*/
    volatile uint32_t GOTGINTF;    /**< @brief OTG interrupt register.         */
    volatile uint32_t GAHBCS;     /**< @brief AHB configuration register.     */
    volatile uint32_t GUSBCS;    /**< @brief USB configuration register.     */
    volatile uint32_t GRSTCTL;    /**< @brief Reset register size.            */
    volatile uint32_t GINTF;    /**< @brief Interrupt register.             */
    volatile uint32_t GINTEN;    /**< @brief Interrupt mask register.        */
    volatile uint32_t GRSTATR;    /**< @brief Receive status debug read register */
    volatile uint32_t GRSTATP;    /**< @brief Receive status read/pop register */
    volatile uint32_t GRFLEN;    /**< @brief Receive FIFO size register.     */
    volatile uint32_t DIEP0TFLEN;   /**< @brief Endpoint 0 transmit FIFO size register */
    volatile uint32_t HNPTFQSTAT;   /**< @brief Non-periodic transmit FIFO/queue status register */
    volatile uint32_t resvd30;
    volatile uint32_t resvd34;
    volatile uint32_t GCCFG;      /**< @brief General core configuration.     */
    volatile uint32_t CID;        /**< @brief 3C Core ID register.               */
    volatile uint32_t resvd58[48];
    volatile uint32_t HPTFLEN;    // 100 Host periodic transmit FIFO size register
    volatile uint32_t DIEPTFLEN[15]; // 104 Device IN endpoint transmit FIFO size registers DIEPTXF
    volatile uint32_t resvd140[176];
    volatile uint32_t HCFG;       /**< @brief 400 Host configuration register.    */
    volatile uint32_t HFIR;       /**< @brief Host frame interval register.   */
    volatile uint32_t HFNUM;      /**< @brief Host frame number/frame time Remaining register */
    volatile uint32_t resvd40C;
    volatile uint32_t HPTXSTS;    /**< @brief Host periodic transmit FIFO/queue status register */
    volatile uint32_t HAINT;      /**< @brief Host all channels interrupt register */
    volatile uint32_t HAINTMSK;   /**< @brief Host all channels interrupt mask register */
    volatile uint32_t resvd41C[9];
    volatile uint32_t HPRT;       /**< @brief Host port control and status register */
    volatile uint32_t resvd444[47];
    UsbHostChnl_TypeDef hc[16];  /**< @brief Host channels array.            */
    volatile uint32_t resvd700[64];
    volatile uint32_t DCFG;       /**< @brief Device configuration register.  */
    volatile uint32_t DCTL;       /**< @brief Device control register.        */
    volatile uint32_t DSTS;       /**< @brief Device status register.         */
    volatile uint32_t resvd80C;
    volatile uint32_t DIEPINTEN;  // 810 Device IN endpoint common interrupt mask register
    volatile uint32_t DOEPINTEN;  // 814 Device OUT endpoint common interrupt mask register
    volatile uint32_t DAEPINT;    // 818 Device all endpoints interrupt register
    volatile uint32_t DAEPINTEN;   // 81C Device all endpoints interrupt mask register
    volatile uint32_t resvd820;
    volatile uint32_t resvd824;
    volatile uint32_t DVBUSDIS;   // 828 Device VBUS discharge time register
    volatile uint32_t DVBUSPULSE; // 82C Device VBUS pulsing time register
    volatile uint32_t resvd830;
    volatile uint32_t DIEPFEINTEN; // 834 Device IN endpoint FIFO empty interrupt mask register
    volatile uint32_t resvd838;
    volatile uint32_t resvd83C;
    volatile uint32_t resvd840[16];
    volatile uint32_t resvd880[16];
    volatile uint32_t resvd8C0[16];
    UsbInEp_Typedef ie[16];     /**< @brief Input endpoints.                */
    UsbOutEp_Typedef oe[16];    /**< @brief Output endpoints.               */
    volatile uint32_t resvdD00[64];
    volatile uint32_t PWRCLKCTL;    /**< @brief Power and clock gating control register */
    volatile uint32_t resvdE04[127];
    volatile uint32_t FIFO[16][1024];


    inline void ConnectBus()    { DCTL &= ~DCTL_SD; }
    inline void DisconnectBus() { DCTL |=  DCTL_SD; }

    inline void DisableGlobalIRQs() { GAHBCS &= ~GAHBCS_GINTEN; }
    inline void EnableGlobalIRQs()  { GAHBCS |=  GAHBCS_GINTEN; }

    // Endpoints
    void EpStallOut(uint32_t ep) { oe[ep].DOEPCTL |= DOEPCTL_STALL;  }
    void EpStallIn(uint32_t ep)  { ie[ep].DIEPCTL |= DIEPCTL_STALL;  }
    void EpClearOut(uint32_t ep) { oe[ep].DOEPCTL &= ~DOEPCTL_STALL; }
    void EpClearIn (uint32_t ep) { ie[ep].DIEPCTL &= ~DIEPCTL_STALL; }
};

#define USB         ((USB_Typedef*)USBFS_BASE)
#endif

#if 1 // ============================= i2c =====================================
#define I2C_CTL0_START      (1UL << 8)
#define I2C_CTL0_STOP       (1UL << 9)
#define I2C_CTL0_ACKEN      (1UL << 10)

#define I2C_CTL1_ERRIE      (1UL << 8)
#define I2C_CTL1_EVIE       (1UL << 9)
#define I2C_CTL1_BUFIE      (1UL << 10)

