kruzhok-team/lapki-compiler/compiler/library/IRPCB/1.0/source/lib/gd32e11x_kl.h
#define I2C_STAT0_SBSEND    (1UL << 0)
#define I2C_STAT0_ADDSEND   (1UL << 1)
#define I2C_STAT0_BTC       (1UL << 2)
#define I2C_STAT0_RBNE      (1UL << 6)
#define I2C_STAT0_TBE       (1UL << 7)
#define I2C_STAT0_BERR      (1UL << 8)
#define I2C_STAT0_LOSTARB   (1UL << 9)
#define I2C_STAT0_AERR      (1UL << 10)
#define I2C_STAT0_OUERR     (1UL << 11)
#define I2C_STAT0_PECERR    (1UL << 12)

#define I2C_STAT1_MASTER    (1UL << 0)
#define I2C_STAT1_I2CBSY    (1UL << 1)

struct I2C_TypeDef {
    volatile uint32_t CTL0;   /*!< Control register 0,         offset: 0x00 */
    volatile uint32_t CTL1;   /*!< Control register 1,         offset: 0x04 */
    volatile uint32_t SADDR0; /*!< Slave address register 0,   offset: 0x08 */
    volatile uint32_t SADDR1; /*!< Slave address register 1,   offset: 0x0C */
    volatile uint32_t DATA;   /*!< Transfer buffer register,   offset: 0x10 */
    volatile uint32_t STAT0;  /*!< Transfer status register 0, offset: 0x14 */
    volatile uint32_t STAT1;  /*!< Transfer status register 1, offset: 0x18 */
    volatile uint32_t CKCFG;  /*!< Clock configure register,   offset: 0x1C */
    volatile uint32_t RT;     /*!< Rise time register,         offset: 0x20 */
    volatile uint32_t resvd1[23];
    volatile uint32_t SAMCFG; /*!< SAM control and status register, Address offset: 0x80 */
    volatile uint32_t resvd2[3];
    volatile uint32_t FMPCFG; /*!< Fast-mode-plus configure register, Address offset: 0x90 */

    void Enable()  { CTL0 |=  (1UL << 0); }
    void Disable() { CTL0 &= ~(1UL << 0); }

    // Data
    uint8_t GetData() { return DATA; }
    void SendAddrWithWrite(uint8_t Addr) { DATA = (uint8_t)(Addr << 1); }
    void SendAddrWithRead (uint8_t Addr) { DATA = ((uint8_t)(Addr<<1)) | 0x01; }
    void SendData(uint32_t b) { DATA = b & 0xFFUL; }

    // Clock
    void SetDutycycle2()    { CKCFG &= ~(1UL << 14); }
    void SetDutycycle16d9() { CKCFG |=  (1UL << 14); }
    void SetSpeedStandard() { CKCFG &= ~(1UL << 15); }
    void SetSpeedFast()     { CKCFG |=  (1UL << 15); }
    void EnFastPlus()       { FMPCFG =  (1UL << 0);  }
    void SetClkc(uint32_t clkc) { SET_BITS(CKCFG, 0xFFFUL, clkc, 0); }

    // Flags
    void ClearStatFlags() { STAT0 = 0; }
    void ClearAddrFlag() { (void)STAT0; (void)STAT1; }
    bool IsBusy() { return STAT1 & (1UL << 1); }
    bool IsRxNotEmpty() { return STAT0 & I2C_STAT0_RBNE; }
    bool IsStartSent()  { return STAT0 & I2C_STAT0_SBSEND; }
    bool IsNACK()       { return STAT0 & I2C_STAT0_AERR; }
    bool IsAddrSentAndACKed() { return STAT0 & I2C_STAT0_ADDSEND; }

    bool IsStartSentAndBusyMaster() {
        uint32_t Flag0 = STAT0;
        uint32_t Flag1 = STAT1;
        return (Flag0 & I2C_STAT0_SBSEND) and (Flag1 & (I2C_STAT1_MASTER | I2C_STAT1_I2CBSY));
    }

    // IRQs
    void EnBufferIRQ()   { CTL1 |= I2C_CTL1_BUFIE; }
    void DisBufferIRQ()  { CTL1 &= ~I2C_CTL1_BUFIE; }
    void EnEventIRQ()    { CTL1 |= I2C_CTL1_EVIE; }
    void DisEventIRQ()   { CTL1 &= ~I2C_CTL1_EVIE; }
    void EnErrorIRQ()    { CTL1 |= I2C_CTL1_ERRIE; }
    void EnAllIRQs()     { CTL1 |= I2C_CTL1_BUFIE | I2C_CTL1_EVIE | I2C_CTL1_ERRIE; }
    void DisAllIRQs()    { CTL1 &= ~(I2C_CTL1_BUFIE | I2C_CTL1_EVIE | I2C_CTL1_ERRIE); }

    // Actions
    void SendStart()     { CTL0 |= I2C_CTL0_START; }
    void SendStop()      { CTL0 |= I2C_CTL0_STOP; }
    void EnAck()         { CTL0 |= I2C_CTL0_ACKEN; }
    void DisAck()        { CTL0 &= ~I2C_CTL0_ACKEN; }
    void FlushDatabuf()  { while(IsRxNotEmpty()) (void)DATA; } // Read DR until it empty
};

#define I2C0    ((I2C_TypeDef*)I2C0_BASE)
#define I2C1    ((I2C_TypeDef*)I2C1_BASE)

#define I2C_DUTYCYCLE_2     1
#define I2C_DUTYCYCLE_16_9  2

#define I2CCLK_MIN_MHz      2UL
#define I2CCLK_MAX_MHz      60UL // > 60 is not allowed due to the limitation of APB1 clock
#endif

#if 1 // ============================= ADC =====================================
#define VREFINT_mV              1200UL // See datasheet, ADC description
// Inner ADC channels. See datasheet
#define ADC_CHNL_Temperature    16UL
#define ADC_CHNL_Vrefint        17UL

#define ADC_CTL0_SM         (1UL <<  8)

#define ADC_CTL1_ADCON      (1UL <<  0)
#define ADC_CTL1_CTN        (1UL <<  1)
#define ADC_CTL1_CLB        (1UL <<  2)
#define ADC_CTL1_RSTCLB     (1UL <<  3)
#define ADC_CTL1_DMA        (1UL <<  8)
#define ADC_CTL1_ETERC      (1UL << 20)
#define ADC_CTL1_SWRCST     (1UL << 22)
#define ADC_CTL1_TSVREN     (1UL << 23)

#define ADC_OVSAMPCTL_OVSEN (1UL << 0)

enum class AdcExtTrgSrc { Tim0C0=0b000UL, Tim0C1=0b001UL, Tim0C2=0b010UL, Tim1C1=0b011UL,
    Tim2TRGO=0b100UL, Tim3C3=0b101UL, Exti11_Tim7TRGO=0b110UL, Swrcst=0b111UL};

enum class AdcSampleTime {
    t1d5Cycles  = 0b000,
    t7d5Cycles  = 0b001,
    t13d5Cycles = 0b010,
    t28d5Cycles = 0b011,
    t41d5Cycles = 0b100,
    t55d5Cycles = 0b101,
    t71d5Cycles = 0b110,
    t239dCycles = 0b111
};

enum class AdcOversamplingRatio : uint32_t { Disabled=0xFFUL, x2=0b000UL, x4=0b001UL,
    x8=0b010UL, x16=0b011UL, x32=0b100UL, x64=0b101UL, x128=0b110UL, x256=0b111UL};
enum class AdcOversamplingShift : uint32_t { NoShift=0b0000UL, sh1bit=0b0001UL,
    sh2bits=0b0010UL, sh3bits=0b0011UL, sh4bits=0b0100UL, sh5bits=0b0101UL,
    sh6bits=0b0110UL, sh7bits=0b0111UL, sh8bits=0b1000UL};

struct ADC_TypeDef {
    volatile uint32_t STAT;      /*!< Status register,                  0x00 */
    volatile uint32_t CTL0;      /*!< Control register 0,               0x04 */
    volatile uint32_t CTL1;      /*!< Control register 1,               0x08 */
    volatile uint32_t SAMPT0;    /*!< Sample time register 0,           0x0C */
    volatile uint32_t SAMPT1;    /*!< Sample time register 1,           0x10 */
    volatile uint32_t resvd1[4];
    volatile uint32_t WDHT;      /*!< Watchdog high threshold register, 0x24 */
    volatile uint32_t WDLT;      /*!< Watchdog low threshold register,  0x28 */
    volatile uint32_t RSQ0;      /*!< Routine sequence register 0,      0x2C */
    volatile uint32_t RSQ1;      /*!< Routine sequence register 1,      0x30 */
    volatile uint32_t RSQ2;      /*!< Routine sequence register 2,      0x34 */
    volatile uint32_t resvd2[5];
    volatile uint32_t RDATA;     /*!< Routine Data register,            0x4C */
    volatile uint32_t resvd3[12];
    volatile uint32_t OVSAMPCTL; /*!< Oversample control register,      0x80 */

    void Enable()  { if((CTL1 & ADC_CTL1_ADCON) == 0) CTL1 |=  ADC_CTL1_ADCON; }
    void Disable() { CTL1 &= ~ADC_CTL1_ADCON; }

    void EnScanMode() { CTL0 |= ADC_CTL0_SM; }
    void EnVrefAndTempChnls() { CTL1 |= ADC_CTL1_TSVREN; }
    void EnExtTrg() { CTL1 |= ADC_CTL1_ETERC; }
    void SelectExtTrg(AdcExtTrgSrc src) { SET_BITS(CTL1, 0b111UL, (uint32_t)src, 17); }
    void EnDMA() { CTL1 |= ADC_CTL1_DMA; }
    void EnOversamping()  { OVSAMPCTL |=  ADC_OVSAMPCTL_OVSEN; }
    void DisOversamping() { OVSAMPCTL &= ~ADC_OVSAMPCTL_OVSEN; }

    void SetupOversampling(AdcOversamplingRatio ratio, AdcOversamplingShift shift) {
        OVSAMPCTL &= ~((0b1111UL << 5) | (0b111UL << 2));
        OVSAMPCTL |= ((uint32_t)shift << 5) | ((uint32_t)ratio << 2);
    }

    void Calibrate() {
        CTL1 |= ADC_CTL1_RSTCLB; // Reset calibration
        while(CTL1 & ADC_CTL1_RSTCLB); // Wait completion
        CTL1 |= ADC_CTL1_CLB; // Perform calibration
        while(CTL1 & ADC_CTL1_CLB); // Wait completion
    }

    void StartConversion() { CTL1 |= ADC_CTL1_SWRCST; } // Set 1 on this bit starts a conversion of a routine sequence if ETSRC is 111

    // Channels setup
    void SetSequenceLength(uint32_t Len) { SET_BITS(RSQ0, 0b1111UL, (Len - 1), 20); }

